Repository: Aptivi/SpecProbe
Catalog: public/SpecProbe/Resources/Languages/Output/Localizations.*.resx
Languages: ar, el, ja, ko, zh

# SPECPROBE_COMMON_UNKNOWN
source: Unknown
ar: غير معروف
el: Άγνωστος
ja: 不明
ko: 알 수 없음
zh: 未知

# SPECPROBE_COMMON_UNKNOWNVENDOR
source: Unknown Vendor
ar: مورد غير معروف
el: Άγνωστος Προμηθευτής
ja: 不明なベンダー
ko: 알 수 없는 공급업체
zh: 未知供應商

# SPECPROBE_PARTS_UNKNOWNGPU
source: Unknown Graphics Card
ar: بطاقة رسومات غير معروفة
el: Άγνωστη Κάρτα Γραφικών
ja: 不明なグラフィックカード
ko: 알 수 없는 그래픽 카드
zh: 未知顯示卡

# SPECPROBE_PCI_EXCEPTION_VENDORNOTFOUND
source: Vendor ID {0} not found.
ar: لم يتم العثور على مُعرّف المورد {0}.
el: Δεν βρέθηκε το ID Προμηθευτή {0}.
ja: ベンダーID {0} が見つかりません。
ko: 공급업체 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到供應商 ID {0}。

# SPECPROBE_PCI_EXCEPTION_VENDORHASNODEVICES
source: Vendor ID {0} doesn't have any devices.
ar: لا يحتوي مُعرّف المورد {0} على أي أجهزة.
el: Το ID Προμηθευτή {0} δεν έχει καμία συσκευή.
ja: ベンダーID {0} にはデバイスがありません。
ko: 공급업체 ID {0}에 장치가 없습니다.
zh: 供應商 ID {0} 沒有任何設備。

# SPECPROBE_PCI_EXCEPTION_DEVICENOTFOUND
source: Device ID {0} not found.
ar: لم يتم العثور على مُعرّف الجهاز {0}.
el: Δεν βρέθηκε το ID Συσκευής {0}.
ja: デバイスID {0} が見つかりません。
ko: 장치 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到裝置 ID {0}。

# SPECPROBE_PCI_EXCEPTION_DEVICEHASNOSUBDEVICES
source: Vendor ID {0} doesn't have any sub-devices that device ID {1} uses.
ar: لا يحتوي مُعرّف المورد {0} على أي أجهزة فرعية يستخدمها مُعرّف الجهاز {1}.
el: Το ID Προμηθευτή {0} δεν έχει καμία υποσυσκευή που να χρησιμοποιεί το ID Συσκευής {1}.
ja: ベンダーID {0} には、デバイスID {1} が使用するサブデバイスがありません。
ko: 공급업체 ID {0}에 장치 ID {1}이(가) 사용하는 하위 장치가 없습니다.
zh: 供應商 ID {0} 沒有設備 ID {1} 使用的任何子設備。

# SPECPROBE_PCI_EXCEPTION_CLASSIDNOTFOUND
source: Class ID {0} not found.
ar: لم يتم العثور على مُعرّف الفئة {0}.
el: Δεν βρέθηκε το ID Κλάσης {0}.
ja: クラスID {0} が見つかりません。
ko: 클래스 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到類別 ID {0}。

# SPECPROBE_PCI_EXCEPTION_CLASSHASNOSUBCLASSES
source: Class ID {0} doesn't have any subclasses.
ar: لا يحتوي مُعرّف الفئة {0} على أي فئات فرعية.
el: Το ID Κλάσης {0} δεν έχει καμία υποκλάση.
ja: クラスID {0} にはサブクラスがありません。
ko: 클래스 ID {0}에 하위 클래스가 없습니다.
zh: 類別 ID {0} 沒有任何子類別。

# SPECPROBE_PCI_EXCEPTION_SUBCLASSIDNOTFOUND
source: Subclass ID {0} not found.
ar: لم يتم العثور على مُعرّف الفئة الفرعية {0}.
el: Δεν βρέθηκε το ID Υποκλάσης {0}.
ja: サブクラスID {0} が見つかりません。
ko: 하위 클래스 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到子類別 ID {0}。

# SPECPROBE_PCI_EXCEPTION_SUBCLASSHASNOINTERFACES
source: Class ID {0} doesn't have any interfaces that subclass ID {1} uses.
ar: لا يحتوي مُعرّف الفئة {0} على أي واجهات يستخدمها مُعرّف الفئة الفرعية {1}.
el: Το ID Κλάσης {0} δεν έχει καμία διεπαφή που να χρησιμοποιεί το ID Υποκλάσης {1}.
ja: クラスID {0} には、サブクラスID {1} が使用するインターフェースがありません。
ko: 클래스 ID {0}에 하위 클래스 ID {1}이(가) 사용하는 인터페이스가 없습니다.
zh: 類別 ID {0} 沒有子類別 ID {1} 使用的任何介面。

# SPECPROBE_PCI_EXCEPTION_INTERFACEIDNOTFOUND
source: Interface ID {0} not found.
ar: لم يتم العثور على مُعرّف الواجهة {0}.
el: Το ID Διεπαφής {0} δεν βρέθηκε.
ja: インターフェースID {0} が見つかりません。
ko: 인터페이스 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到介面 ID {0}。

# SPECPROBE_PROBERS_EXCEPTION_CANTPARSEMEMSTATUS
source: Can't get memory status
ar: لا يمكن الحصول على حالة الذاكرة.
el: Δεν είναι δυνατή η λήψη της κατάστασης μνήμης
ja: メモリステータスを取得できません
ko: 메모리 상태를 가져올 수 없습니다.
zh: 無法取得記憶體狀態

# SPECPROBE_PROBERS_EXCEPTION_CGQUARTZPROBEFAILED
source: CGGetOnlineDisplayList() probing part from Quartz failed:
ar: فشل جزء فحص دالة CGGetOnlineDisplayList() من Quartz:
el: Η ανίχνευση του τμήματος CGGetOnlineDisplayList() από το Quartz απέτυχε:
ja: Quartz からの CGGetOnlineDisplayList() プローブ部分が失敗しました:
ko: Quartz에서 부분을 프로브하는 CGGetOnlineDisplayList()가 실패했습니다.
zh: 來自 Quartz 的 CGGetOnlineDisplayList() 探測部分失敗：

# SPECPROBE_PROBERS_EXCEPTION_CGQUARTZLISTFAILED
source: CGGetOnlineDisplayList() screen listing part from Quartz failed:
ar: فشل جزء قائمة الشاشة CGGetOnlineDisplayList() من Quartz:
el: Το τμήμα καταχώρισης οθόνης CGGetOnlineDisplayList() από το Quartz απέτυχε:
ja: Quartz からの CGGetOnlineDisplayList() 画面リスト部分が失敗しました:
ko: Quartz에서 부분을 나열하는 CGGetOnlineDisplayList()가 실패했습니다.
zh: 來自 Quartz 的 CGGetOnlineDisplayList() 螢幕清單部分失敗：

# SPECPROBE_PROBERS_EXCEPTION_CANTPARSEGPUS
source: Can't parse video cards.
ar: لا يمكن تحليل بطاقات الفيديو.
el: Δεν είναι δυνατή η ανάλυση καρτών γραφικών.
ja: ビデオカードを解析できません。
ko: 비디오 카드를 구문 분석할 수 없습니다.
zh: 無法解析顯示卡。

# SPECPROBE_USB_EXCEPTION_SUBCLASSHASNOPROTOCOLS
source: Class ID {0} doesn't have any protocols that subclass ID {1} uses.
ar: لا يحتوي مُعرّف الفئة {0} على أي بروتوكولات يستخدمها مُعرّف الفئة الفرعية {1}.
el: Το ID Κλάσης {0} δεν έχει κανένα πρωτόκολλο που να χρησιμοποιεί το ID Υποκλάσης {1}.
ja: クラスID {0} には、サブクラスID {1} が使用するプロトコルがありません。
ko: 클래스 ID {0}에 하위 클래스 ID {1}이(가) 사용하는 프로토콜이 없습니다.
zh: 類別 ID {0} 沒有子類別 ID {1} 使用的任何協定。

# SPECPROBE_USB_EXCEPTION_PROTOCOLIDNOTFOUND
source: Protocol ID {0} not found.
ar: لم يتم العثور على مُعرّف البروتوكول {0}.
el: Δεν βρέθηκε το ID Πρωτοκόλλου {0}.
ja: プロトコルID {0} が見つかりません。
ko: 프로토콜 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到協定 ID {0}。

# SPECPROBE_USB_EXCEPTION_AUDIOTERMINALIDNOTFOUND
source: Audio terminal ID {0} not found.
ar: لم يتم العثور على معرف جهاز الصوت {0}.
el: Το ID Τερματικού Ήχου {0} δεν βρέθηκε.
ja: オーディオ端末ID {0} が見つかりません。
ko: 오디오 터미널 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到音訊終端 ID {0}。

# SPECPROBE_USB_EXCEPTION_HIDIDNOTFOUND
source: HID ID {0} not found.
ar: لم يتم العثور على معرف HID {0}.
el: Το αναγνωριστικό HID {0} δεν βρέθηκε.
ja: HID ID {0} が見つかりません。
ko: HID ID {0}을(를) 찾을 수 없습니다.
zh: 未找到 HID ID {0}。

# SPECPROBE_USB_EXCEPTION_HIDITEMIDNOTFOUND
source: HID item ID {0} not found.
ar: لم يتم العثور على معرف عنصر HID {0}.
el: Το αναγνωριστικό στοιχείου HID {0} δεν βρέθηκε.
ja: HID アイテム ID {0} が見つかりません。
ko: HID 항목 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到 HID 項 ID {0}。

# SPECPROBE_USB_EXCEPTION_HIDPHYSBIASIDNOTFOUND
source: HID physical bias ID {0} not found.
ar: لم يتم العثور على معرف التحيز المادي لـ HID {0}.
el: Το αναγνωριστικό φυσικής πόλωσης HID {0} δεν βρέθηκε.
ja: HID 物理バイアス ID {0} が見つかりません。
ko: HID 물리적 바이어스 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到 HID 物理偏差 ID {0}。

# SPECPROBE_USB_EXCEPTION_HIDPHYSDESCIDNOTFOUND
source: HID physical descriptor ID {0} not found.
ar: لم يتم العثور على معرف الوصف المادي لـ HID {0}.
el: Το αναγνωριστικό φυσικής περιγραφής HID {0} δεν βρέθηκε.
ja: HID 物理記述子 ID {0} が見つかりません。
ko: HID 물리적 설명자 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到 HID 物理描述符 ID {0}。

# SPECPROBE_USB_EXCEPTION_HIDUSAGEPAGEIDNOTFOUND
source: HID usage page ID {0} not found.
ar: لم يتم العثور على معرف صفحة استخدام HID {0}.
el: Το αναγνωριστικό σελίδας χρήσης HID {0} δεν βρέθηκε.
ja: HID 使用ページ ID {0} が見つかりません。
ko: HID 사용 페이지 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到 HID 使用頁面 ID {0}。

# SPECPROBE_USB_EXCEPTION_HIDUSAGEPAGEHASNOUSAGES
source: HID usage page ID {0} doesn't have any HID Usage.
ar: لا تحتوي صفحة استخدام HID {0} على أي استخدام لـ HID.
el: Το αναγνωριστικό σελίδας χρήσης HID {0} δεν έχει καμία χρήση HID.
ja: HID 使用ページ ID {0} には HID 使用がありません。
ko: HID 사용 페이지 ID {0}에 HID 사용이 없습니다.
zh: HID 使用頁面 ID {0} 沒有任何 HID 使用量。

# SPECPROBE_USB_EXCEPTION_HIDUSAGEIDNOTFOUND
source: HID usage ID {0} not found.
ar: لم يتم العثور على معرف استخدام HID {0}.
el: Το αναγνωριστικό χρήσης HID {0} δεν βρέθηκε.
ja: HID 使用 ID {0} が見つかりません。
ko: HID 사용 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到 HID 使用 ID {0}。

# SPECPROBE_USB_EXCEPTION_LANGUAGEIDNOTFOUND
source: Language ID {0} not found.
ar: لم يتم العثور على معرف اللغة {0}.
el: Το αναγνωριστικό γλώσσας {0} δεν βρέθηκε.
ja: 言語 ID {0} が見つかりません。
ko: 언어 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到語言 ID {0}。

# SPECPROBE_USB_EXCEPTION_LANGUAGEHASNODIALECTS
source: Language ID {0} doesn't have any dialects.
ar: لا يحتوي معرف اللغة {0} على أي لهجات.
el: Το αναγνωριστικό γλώσσας {0} δεν έχει διαλέκτους.
ja: 言語 ID {0} には方言がありません。
ko: 언어 ID {0}에 방언이 없습니다.
zh: 語言 ID {0} 沒有任何方言。

# SPECPROBE_USB_EXCEPTION_DIALECTIDNOTFOUND
source: Dialect ID {0} not found.
ar: لم يتم العثور على معرف اللهجة {0}.
el: Το αναγνωριστικό διαλέκτου {0} δεν βρέθηκε.
ja: 方言 ID {0} が見つかりません。
ko: 방언 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到方言 ID {0}。

# SPECPROBE_USB_EXCEPTION_COUNTRYCODEIDNOTFOUND
source: Country code ID {0} not found.
ar: لم يتم العثور على معرف رمز البلد {0}.
el: Το αναγνωριστικό κωδικού χώρας {0} δεν βρέθηκε.
ja: 国コード ID {0} が見つかりません。
ko: 국가 코드 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到國家/地區代碼 ID {0}。

# SPECPROBE_USB_EXCEPTION_VIDEOTERMINALIDNOTFOUND
source: Video terminal ID {0} not found.
ar: لم يتم العثور على معرف جهاز الفيديو {0}.
el: Το αναγνωριστικό τερματικού βίντεο {0} δεν βρέθηκε.
ja: ビデオ端末 ID {0} が見つかりません。
ko: 비디오 단말기 ID {0}을(를) 찾을 수 없습니다.
zh: 未找到視訊終端 ID {0}。
